#pragma wrench parser on

struct SubVars {
	/* 0x00 */ void* unknown_00;
	/* 0x04 */ void* unknown_04;
	/* 0x08 */ void* unknown_08;
	/* 0x0c */ void* unknown_0c;
	/* 0x10 */ void* unknown_10;
	/* 0x14 */ void* unknown_14;
	/* 0x18 */ void* unknown_18;
	/* 0x1c */ void* unknown_1c;
	/* 0x20 */ void* unknown_20;
	/* 0x24 */ void* unknown_24;
	/* 0x28 */ void* unknown_28;
	/* 0x2c */ void* unknown_2c;
};
