#pragma wrench parser on

struct SubVars {
	/* 0x00 */ void* unknown_00;
	/* 0x04 */ void* unknown_04;
	/* 0x08 */ void* unknown_08;
	/* 0x0c */ void* unknown_0c;
	/* 0x10 */ void* unknown_10;
	/* 0x14 */ void* unknown_14;
	/* 0x18 */ void* unknown_18;
	/* 0x1c */ void* unknown_1c;
	/* 0x20 */ void* unknown_20;
	/* 0x24 */ void* unknown_24;
	/* 0x28 */ void* unknown_28;
	/* 0x2c */ void* unknown_2c;
};

struct TargetVars {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
};

struct UyaVars04 {
	/* 0x00 */ int unknown_0;
};

struct TrackVars {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
};

struct UyaVars0c {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
};

struct ReactVars {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
	/* 0x40 */ int unknown_40;
	/* 0x44 */ int unknown_44;
	/* 0x48 */ int unknown_48;
	/* 0x4c */ int unknown_4c;
	/* 0x50 */ int unknown_50;
	/* 0x54 */ int unknown_54;
	/* 0x58 */ int unknown_58;
	/* 0x5c */ int unknown_5c;
	/* 0x60 */ int unknown_60;
	/* 0x64 */ int unknown_64;
	/* 0x68 */ int unknown_68;
	/* 0x6c */ int unknown_6c;
	/* 0x70 */ int unknown_70;
	/* 0x74 */ int unknown_74;
	/* 0x78 */ int unknown_78;
	/* 0x7c */ int unknown_7c;
	/* 0x80 */ int unknown_80;
	/* 0x84 */ int unknown_84;
	/* 0x88 */ int unknown_88;
	/* 0x8c */ int unknown_8c;
	/* 0x90 */ int unknown_90;
	/* 0x94 */ int unknown_94;
	/* 0x98 */ int unknown_98;
	/* 0x9c */ int unknown_9c;
	/* 0xa0 */ int unknown_a0;
	/* 0xa4 */ int unknown_a4;
	/* 0xa8 */ int unknown_a8;
	/* 0xac */ int unknown_ac;
	/* 0xb0 */ int unknown_b0;
	/* 0xb4 */ int unknown_b4;
	/* 0xb8 */ int unknown_b8;
	/* 0xbc */ int unknown_bc;
};

struct UyaVars14 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
};

struct UyaVars18 {
	/* 0x00 */ int unknown_0;
};

struct UyaVars1c {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
	/* 0x40 */ int unknown_40;
	/* 0x44 */ int unknown_44;
	/* 0x48 */ int unknown_48;
	/* 0x4c */ int unknown_4c;
	/* 0x50 */ int unknown_50;
	/* 0x54 */ int unknown_54;
	/* 0x58 */ int unknown_58;
	/* 0x5c */ int unknown_5c;
	/* 0x60 */ int unknown_60;
	/* 0x64 */ int unknown_64;
	/* 0x68 */ int unknown_68;
	/* 0x6c */ int unknown_6c;
	/* 0x70 */ int unknown_70;
	/* 0x74 */ int unknown_74;
	/* 0x78 */ int unknown_78;
	/* 0x7c */ int unknown_7c;
	/* 0x80 */ int unknown_80;
	/* 0x84 */ int unknown_84;
	/* 0x88 */ int unknown_88;
	/* 0x8c */ int unknown_8c;
	/* 0x90 */ int unknown_90;
	/* 0x94 */ int unknown_94;
	/* 0x98 */ int unknown_98;
	/* 0x9c */ int unknown_9c;
	/* 0xa0 */ int unknown_a0;
	/* 0xa4 */ int unknown_a4;
	/* 0xa8 */ int unknown_a8;
	/* 0xac */ int unknown_ac;
	/* 0xb0 */ int unknown_b0;
	/* 0xb4 */ int unknown_b4;
	/* 0xb8 */ int unknown_b8;
	/* 0xbc */ int unknown_bc;
	/* 0xc0 */ int unknown_c0;
	/* 0xc4 */ int unknown_c4;
	/* 0xc8 */ int unknown_c8;
	/* 0xcc */ int unknown_cc;
	/* 0xd0 */ int unknown_d0;
	/* 0xd4 */ int unknown_d4;
	/* 0xd8 */ int unknown_d8;
	/* 0xdc */ int unknown_dc;
	/* 0xe0 */ int unknown_e0;
	/* 0xe4 */ int unknown_e4;
	/* 0xe8 */ int unknown_e8;
	/* 0xec */ int unknown_ec;
};

struct ArmorVars {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
};

struct UyaVars24 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
};

struct UyaVars28 {
	/* 0x00 */ int unknown_0;
};

struct UyaVars2c {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
};
