#pragma wrench parser on

struct update918 { // 0x280
	/* 0x000 */ npcVars npcVars;
	/* 0x040 */ Tweaker tweaks[4];
	/* 0x240 */ int unknown_240;
	/* 0x244 */ int timer1;
	/* 0x248 */ int timer2;
	/* 0x24c */ int timer3;
	/* 0x250 */ int unknown_250;
	/* 0x254 */ int unknown_254;
	/* 0x258 */ int unknown_258;
	/* 0x25c */ int unknown_25c;
	/* 0x260 */ int unknown_260;
	/* 0x264 */ int unknown_264;
	/* 0x268 */ int unknown_268;
	/* 0x26c */ int unknown_26c;
	/* 0x270 */ int unknown_270;
	/* 0x274 */ int unknown_274;
	/* 0x278 */ int unknown_278;
	/* 0x27c */ int unknown_27c;
};
