#pragma wrench parser on

struct update726 { // 0xd0
	/* 0x00 */ SubVars subVars;
	/* 0x20 */ RacVars00 racVars00;
	/* 0x60 */ RacVars08 racVars08;
	/* 0xa0 */ int unknown_a0;
	/* 0xa4 */ int unknown_a4;
	/* 0xa8 */ int unknown_a8;
	/* 0xac */ int unknown_ac;
	/* 0xb0 */ float moveSpeed;
	/* 0xb4 */ pathlink movePath;
	/* 0xb8 */ int unknown_b8;
	/* 0xbc */ int unknown_bc;
	/* 0xc0 */ int unknown_c0;
	/* 0xc4 */ int unknown_c4;
	/* 0xc8 */ int unknown_c8;
	/* 0xcc */ int unknown_cc;
};
