#pragma wrench parser on

struct update114 { // 0x2e0
	/* 0x000 */ SubVars subVars;
	/* 0x020 */ npcVars npcVars;
	/* 0x060 */ int unknown_60;
	/* 0x064 */ int unknown_64;
	/* 0x068 */ int unknown_68;
	/* 0x06c */ int unknown_6c;
	/* 0x070 */ int unknown_70;
	/* 0x074 */ int unknown_74;
	/* 0x078 */ int unknown_78;
	/* 0x07c */ int unknown_7c;
	/* 0x080 */ int unknown_80;
	/* 0x084 */ int unknown_84;
	/* 0x088 */ int unknown_88;
	/* 0x08c */ int unknown_8c;
	/* 0x090 */ int unknown_90;
	/* 0x094 */ int unknown_94;
	/* 0x098 */ int unknown_98;
	/* 0x09c */ int unknown_9c;
	/* 0x0a0 */ int unknown_a0;
	/* 0x0a4 */ int unknown_a4;
	/* 0x0a8 */ int unknown_a8;
	/* 0x0ac */ int unknown_ac;
	/* 0x0b0 */ int unknown_b0;
	/* 0x0b4 */ int unknown_b4;
	/* 0x0b8 */ int unknown_b8;
	/* 0x0bc */ int unknown_bc;
	/* 0x0c0 */ int unknown_c0;
	/* 0x0c4 */ int unknown_c4;
	/* 0x0c8 */ int unknown_c8;
	/* 0x0cc */ int unknown_cc;
	/* 0x0d0 */ int unknown_d0;
	/* 0x0d4 */ int unknown_d4;
	/* 0x0d8 */ int unknown_d8;
	/* 0x0dc */ int unknown_dc;
	/* 0x0e0 */ int unknown_e0;
	/* 0x0e4 */ int unknown_e4;
	/* 0x0e8 */ int unknown_e8;
	/* 0x0ec */ int unknown_ec;
	/* 0x0f0 */ mobylink moby_f0;
	/* 0x0f4 */ mobylink moby_f4;
	/* 0x0f8 */ int unknown_f8;
	/* 0x0fc */ int unknown_fc;
	/* 0x100 */ mobylink moby_100;
	/* 0x104 */ mobylink moby_104;
	/* 0x108 */ int unknown_108;
	/* 0x10c */ int unknown_10c;
	/* 0x110 */ int unknown_110;
	/* 0x114 */ int unknown_114;
	/* 0x118 */ int unknown_118;
	/* 0x11c */ int unknown_11c;
	/* 0x120 */ int unknown_120;
	/* 0x124 */ int unknown_124;
	/* 0x128 */ int unknown_128;
	/* 0x12c */ int unknown_12c;
	/* 0x130 */ int unknown_130;
	/* 0x134 */ int unknown_134;
	/* 0x138 */ int unknown_138;
	/* 0x13c */ int unknown_13c;
	/* 0x140 */ int unknown_140;
	/* 0x144 */ int unknown_144;
	/* 0x148 */ int unknown_148;
	/* 0x14c */ int unknown_14c;
	/* 0x150 */ int unknown_150;
	/* 0x154 */ int unknown_154;
	/* 0x158 */ int unknown_158;
	/* 0x15c */ int unknown_15c;
	/* 0x160 */ int unknown_160;
	/* 0x164 */ int unknown_164;
	/* 0x168 */ int unknown_168;
	/* 0x16c */ int unknown_16c;
	/* 0x170 */ int unknown_170;
	/* 0x174 */ int unknown_174;
	/* 0x178 */ int unknown_178;
	/* 0x17c */ int unknown_17c;
	/* 0x180 */ int unknown_180;
	/* 0x184 */ int unknown_184;
	/* 0x188 */ int unknown_188;
	/* 0x18c */ int unknown_18c;
	/* 0x190 */ int unknown_190;
	/* 0x194 */ int unknown_194;
	/* 0x198 */ int unknown_198;
	/* 0x19c */ int unknown_19c;
	/* 0x1a0 */ int unknown_1a0;
	/* 0x1a4 */ int unknown_1a4;
	/* 0x1a8 */ int unknown_1a8;
	/* 0x1ac */ int unknown_1ac;
	/* 0x1b0 */ int unknown_1b0;
	/* 0x1b4 */ int unknown_1b4;
	/* 0x1b8 */ int unknown_1b8;
	/* 0x1bc */ int unknown_1bc;
	/* 0x1c0 */ int unknown_1c0;
	/* 0x1c4 */ int unknown_1c4;
	/* 0x1c8 */ int unknown_1c8;
	/* 0x1cc */ int unknown_1cc;
	/* 0x1d0 */ int unknown_1d0;
	/* 0x1d4 */ int unknown_1d4;
	/* 0x1d8 */ int unknown_1d8;
	/* 0x1dc */ int unknown_1dc;
	/* 0x1e0 */ int unknown_1e0;
	/* 0x1e4 */ int unknown_1e4;
	/* 0x1e8 */ int unknown_1e8;
	/* 0x1ec */ int unknown_1ec;
	/* 0x1f0 */ int unknown_1f0;
	/* 0x1f4 */ int unknown_1f4;
	/* 0x1f8 */ int unknown_1f8;
	/* 0x1fc */ int unknown_1fc;
	/* 0x200 */ int unknown_200;
	/* 0x204 */ int unknown_204;
	/* 0x208 */ int unknown_208;
	/* 0x20c */ int unknown_20c;
	/* 0x210 */ int unknown_210;
	/* 0x214 */ int unknown_214;
	/* 0x218 */ int unknown_218;
	/* 0x21c */ int unknown_21c;
	/* 0x220 */ int unknown_220;
	/* 0x224 */ int unknown_224;
	/* 0x228 */ int unknown_228;
	/* 0x22c */ int unknown_22c;
	/* 0x230 */ int unknown_230;
	/* 0x234 */ int unknown_234;
	/* 0x238 */ int unknown_238;
	/* 0x23c */ int unknown_23c;
	/* 0x240 */ int unknown_240;
	/* 0x244 */ int unknown_244;
	/* 0x248 */ int unknown_248;
	/* 0x24c */ int unknown_24c;
	/* 0x250 */ int unknown_250;
	/* 0x254 */ int unknown_254;
	/* 0x258 */ int unknown_258;
	/* 0x25c */ int unknown_25c;
	/* 0x260 */ int unknown_260;
	/* 0x264 */ int unknown_264;
	/* 0x268 */ int unknown_268;
	/* 0x26c */ int unknown_26c;
	/* 0x270 */ int unknown_270;
	/* 0x274 */ int unknown_274;
	/* 0x278 */ int unknown_278;
	/* 0x27c */ int unknown_27c;
	/* 0x280 */ int unknown_280;
	/* 0x284 */ int unknown_284;
	/* 0x288 */ int unknown_288;
	/* 0x28c */ int unknown_28c;
	/* 0x290 */ int unknown_290;
	/* 0x294 */ int unknown_294;
	/* 0x298 */ int unknown_298;
	/* 0x29c */ int unknown_29c;
	/* 0x2a0 */ int unknown_2a0;
	/* 0x2a4 */ int unknown_2a4;
	/* 0x2a8 */ int unknown_2a8;
	/* 0x2ac */ int unknown_2ac;
	/* 0x2b0 */ int unknown_2b0;
	/* 0x2b4 */ int unknown_2b4;
	/* 0x2b8 */ int unknown_2b8;
	/* 0x2bc */ int unknown_2bc;
	/* 0x2c0 */ int unknown_2c0;
	/* 0x2c4 */ int unknown_2c4;
	/* 0x2c8 */ int unknown_2c8;
	/* 0x2cc */ int unknown_2cc;
	/* 0x2d0 */ int unknown_2d0;
	/* 0x2d4 */ int unknown_2d4;
	/* 0x2d8 */ int unknown_2d8;
	/* 0x2dc */ int unknown_2dc;
};
