#pragma wrench parser on

struct update613 { // 0x30
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ pathlink flowPath;
	/* 0x24 */ float speed;
	/* 0x28 */ float unknown_28;
	/* 0x2c */ int unknown_2c;
};
