#pragma wrench parser on

struct update851 { // 0x1a0
	/* 0x000 */ npcVars npcVars;
	/* 0x040 */ int unknown_40;
	/* 0x044 */ mobylink moby_44;
	/* 0x048 */ int unknown_48;
	/* 0x04c */ int unknown_4c;
	/* 0x050 */ int unknown_50;
	/* 0x054 */ int unknown_54;
	/* 0x058 */ int unknown_58;
	/* 0x05c */ int unknown_5c;
	/* 0x060 */ int unknown_60;
	/* 0x064 */ int unknown_64;
	/* 0x068 */ int unknown_68;
	/* 0x06c */ int unknown_6c;
	/* 0x070 */ int unknown_70;
	/* 0x074 */ int unknown_74;
	/* 0x078 */ int unknown_78;
	/* 0x07c */ int unknown_7c;
	/* 0x080 */ int unknown_80;
	/* 0x084 */ int unknown_84;
	/* 0x088 */ int unknown_88;
	/* 0x08c */ int unknown_8c;
	/* 0x090 */ int unknown_90;
	/* 0x094 */ int unknown_94;
	/* 0x098 */ int unknown_98;
	/* 0x09c */ int unknown_9c;
	/* 0x0a0 */ int unknown_a0;
	/* 0x0a4 */ int unknown_a4;
	/* 0x0a8 */ int unknown_a8;
	/* 0x0ac */ int unknown_ac;
	/* 0x0b0 */ int unknown_b0;
	/* 0x0b4 */ int unknown_b4;
	/* 0x0b8 */ int unknown_b8;
	/* 0x0bc */ int unknown_bc;
	/* 0x0c0 */ int unknown_c0;
	/* 0x0c4 */ int unknown_c4;
	/* 0x0c8 */ int unknown_c8;
	/* 0x0cc */ int unknown_cc;
	/* 0x0d0 */ int unknown_d0;
	/* 0x0d4 */ int unknown_d4;
	/* 0x0d8 */ int unknown_d8;
	/* 0x0dc */ int unknown_dc;
	/* 0x0e0 */ int unknown_e0;
	/* 0x0e4 */ int unknown_e4;
	/* 0x0e8 */ int unknown_e8;
	/* 0x0ec */ int unknown_ec;
	/* 0x0f0 */ int unknown_f0;
	/* 0x0f4 */ int unknown_f4;
	/* 0x0f8 */ int unknown_f8;
	/* 0x0fc */ int unknown_fc;
	/* 0x100 */ int unknown_100;
	/* 0x104 */ int unknown_104;
	/* 0x108 */ int unknown_108;
	/* 0x10c */ int unknown_10c;
	/* 0x110 */ int unknown_110;
	/* 0x114 */ int unknown_114;
	/* 0x118 */ int unknown_118;
	/* 0x11c */ int unknown_11c;
	/* 0x120 */ int unknown_120;
	/* 0x124 */ int unknown_124;
	/* 0x128 */ int unknown_128;
	/* 0x12c */ int unknown_12c;
	/* 0x130 */ int unknown_130;
	/* 0x134 */ int unknown_134;
	/* 0x138 */ int unknown_138;
	/* 0x13c */ int unknown_13c;
	/* 0x140 */ int unknown_140;
	/* 0x144 */ int unknown_144;
	/* 0x148 */ int unknown_148;
	/* 0x14c */ int unknown_14c;
	/* 0x150 */ int unknown_150;
	/* 0x154 */ int unknown_154;
	/* 0x158 */ int unknown_158;
	/* 0x15c */ int unknown_15c;
	/* 0x160 */ int unknown_160;
	/* 0x164 */ int unknown_164;
	/* 0x168 */ int unknown_168;
	/* 0x16c */ int unknown_16c;
	/* 0x170 */ int unknown_170;
	/* 0x174 */ int unknown_174;
	/* 0x178 */ int unknown_178;
	/* 0x17c */ int unknown_17c;
	/* 0x180 */ int unknown_180;
	/* 0x184 */ int unknown_184;
	/* 0x188 */ int unknown_188;
	/* 0x18c */ int unknown_18c;
	/* 0x190 */ int unknown_190;
	/* 0x194 */ int unknown_194;
	/* 0x198 */ int unknown_198;
	/* 0x19c */ int unknown_19c;
};
