#pragma wrench parser on

struct update1135 { // 0x50
	/* 0x00 */ mobylink destination;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
	/* 0x40 */ int unknown_40;
	/* 0x44 */ int unknown_44;
	/* 0x48 */ int unknown_48;
	/* 0x4c */ int unknown_4c;
};
