/*
	wrench - A set of modding tools for the Ratchet & Clank PS2 games.
	Copyright (C) 2019-2021 chaoticgd

	This program is free software: you can redistribute it and/or modify
	it under the terms of the GNU General Public License as published by
	the Free Software Foundation, either version 3 of the License, or
	(at your option) any later version.

	This program is distributed in the hope that it will be useful,
	but WITHOUT ANY WARRANTY; without even the implied warranty of
	MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
	GNU General Public License for more details.

	You should have received a copy of the GNU General Public License
	along with this program.  If not, see <https://www.gnu.org/licenses/>.
*/

#include "gameplay.h"

const s32 NONE = -1;

void read_gameplay(Gameplay& gameplay, Buffer src, Game game, const std::vector<GameplayBlockDescription>& blocks) {
	for(const GameplayBlockDescription& block : blocks) {
		s32 block_offset = src.read<s32>(block.header_pointer_offset, "gameplay header");
		if(block_offset != 0 && block.funcs.read != nullptr) {
			block.funcs.read(gameplay, src.subbuf(block_offset), game);
		}
	}
}

std::vector<u8> write_gameplay(const Gameplay& gameplay, Game game, const std::vector<GameplayBlockDescription>& blocks) {
	s32 header_size = 0;
	s32 block_count = 0;
	for(const GameplayBlockDescription& block : blocks) {
		header_size = std::max(header_size, block.header_pointer_offset + 4);
		if(block.header_pointer_offset != NONE) {
			block_count++;
		}
	}
	assert(header_size == block_count * 4);
	
	std::vector<u8> dest_vec(header_size, 0);
	OutBuffer dest(dest_vec);
	for(const GameplayBlockDescription& block : blocks) {
		if(block.header_pointer_offset != NONE && block.funcs.write != nullptr) {
			if(strcmp(block.name, "us english strings") != 0) {
				dest.pad(0x10, 0);
			}
			if(strcmp(block.name, "occlusion clusters") == 0) {
				dest.pad(0x40, 0);
			}
			s32 ofs = (s32) dest_vec.size();
			if(block.funcs.write(dest, gameplay, game)) {
				assert(block.header_pointer_offset + 4 <= (s32) dest_vec.size());
				*(s32*) &dest_vec[block.header_pointer_offset] = ofs;
				if(strcmp(block.name, "art instance shrub groups") == 0
					&& gameplay.shrub_groups.has_value()
					&& gameplay.shrub_groups->second_part.size() > 0) {
					dest.pad(0x40, 0);
				}
			}
		}
	}
	return dest_vec;
}

packed_struct(TableHeader,
	s32 count_1;
	s32 pad[3];
)

template <typename T>
struct TableBlock {
	static void read(std::vector<T>& dest, Buffer src, Game game) {
		auto header = src.read<TableHeader>(0, "table header");
		verify(header.pad[0] == 0, "TableBlock contains more than one table.");
		dest = src.read_multiple<T>(0x10, header.count_1, "table body").copy();
	}
	
	static void write(OutBuffer dest, const std::vector<T>& src, Game game) {
		TableHeader header = {(s32) src.size()};
		dest.write(header);
		for(const T& elem : src) {
			dest.write(elem);
		}
	}
};

struct PropertiesBlock {
	static void read(GpProperties& dest, Buffer src, Game game) {
		s32 ofs = 0;
		dest.first_part = src.read<GpPropertiesFirstPart>(ofs, "gameplay properties");
		ofs += sizeof(GpPropertiesFirstPart);
		s32 second_part_count = src.read<s32>(ofs + 0xc, "second part count");
		if(second_part_count > 0) {
			dest.second_part = src.read_multiple<GpPropertiesSecondPart>(ofs, second_part_count, "second part").copy();
			ofs += second_part_count * sizeof(GpPropertiesSecondPart);
		} else {
			ofs += sizeof(GpPropertiesSecondPart);
		}
		dest.core_sounds_count = src.read<s32>(ofs, "core sounds count");
		if(game == Game::DL) {
			ofs += 4;
			s64 third_part_count = src.read<s32>(ofs, "third part count");
			ofs += 4;
			if(third_part_count >= 0) {
				dest.third_part = src.read_multiple<GpPropertiesThirdPart>(ofs, third_part_count, "third part").copy();
				ofs += third_part_count * sizeof(GpPropertiesThirdPart);
				dest.fourth_part = src.read<GpPropertiesFourthPart>(ofs, "fourth part");
				ofs += sizeof(GpPropertiesFourthPart);
			} else {
				ofs += sizeof(GpPropertiesThirdPart);
			}
			dest.fifth_part = src.read<GpPropertiesFifthPart>(ofs, "fifth part");
			ofs += sizeof(GpPropertiesFifthPart);
			dest.sixth_part = src.read_multiple<s8>(ofs, dest.fifth_part.sixth_part_count, "sixth part").copy();
		}
	}
	
	static void write(OutBuffer dest, const GpProperties& src, Game game) {
		dest.write(src.first_part);
		if(src.second_part.size() > 0) {
			dest.write_multiple(src.second_part);
		} else {
			GpPropertiesSecondPart terminator = {0};
			dest.write(terminator);
		}
		dest.write(src.core_sounds_count);
		if(game == Game::DL) {
			dest.write((s32) src.third_part.size());
			if(src.third_part.size() > 0) {
				dest.write_multiple(src.third_part);
				dest.write(src.fourth_part);
			} else {
				dest.vec.resize(dest.tell() + 0x18, 0);
			}
			dest.write(src.fifth_part);
			dest.write_multiple(src.sixth_part);
		}
	}
};

packed_struct(StringBlockHeader,
	s32 string_count;
	s32 size;
)

packed_struct(StringTableEntry,
	s32 offset;
	s16 id;
	s16 unknown_6;
	s32 unknown_8;
	s16 unknown_c;
	s16 unknown_e;
)

struct StringBlock {
	static void read(std::vector<GpString>& dest, Buffer src, Game game) {
		auto& header = src.read<StringBlockHeader>(0, "string block header");
		auto table = src.read_multiple<StringTableEntry>(8, header.string_count, "string table");
		
		if(game == Game::RAC3 || game == Game::DL) {
			src = src.subbuf(8);
		}
		
		for(StringTableEntry entry : table) {
			GpString string;
			if(entry.offset != 0) {
				string.string = src.read_string(entry.offset);
			}
			string.id = entry.id;
			string.unknown_6 = entry.unknown_6;
			string.unknown_8 = entry.unknown_8;
			string.unknown_c = entry.unknown_c;
			string.unknown_e = entry.unknown_e;
			dest.emplace_back(std::move(string));
		}
	}
	
	static void write(OutBuffer dest, const std::vector<GpString>& src, Game game) {
		s64 header_ofs = dest.alloc<StringBlockHeader>();
		s64 table_ofs = dest.alloc_multiple<StringTableEntry>(src.size());
		
		s64 base_ofs;
		if(game == Game::RAC3 || game == Game::DL) {
			base_ofs = table_ofs;
		} else {
			base_ofs = header_ofs;
		}
		
		s64 entry_ofs = table_ofs;
		for(const GpString& string : src) {
			StringTableEntry entry {0};
			if(string.string) {
				entry.offset = dest.tell() - base_ofs;
			}
			entry.id = string.id;
			entry.unknown_6 = string.unknown_6;
			entry.unknown_8 = string.unknown_8;
			entry.unknown_c = string.unknown_c;
			entry.unknown_e = string.unknown_e;
			dest.write(entry_ofs, entry);
			entry_ofs += sizeof(StringTableEntry);
			if(string.string) {
				for(char c : *string.string) {
					dest.write(c);
				}
				dest.write('\0');
				if(game == Game::RAC1 || game == Game::RAC2) {
					dest.pad(0x4, 0);
				}
			}
		}
		StringBlockHeader header;
		header.string_count = src.size();
		header.size = dest.tell() - base_ofs;
		dest.write(header_ofs, header);
	}
};

template <typename Instance, typename Packed>
struct InstanceBlock {
	static void read(std::vector<Instance>& dest, Buffer src, Game game) {
		TableHeader header = src.read<TableHeader>(0, "instance block header");
		auto entries = src.read_multiple<Packed>(0x10, header.count_1, "instances");
		for(Packed packed : entries) {
			Instance inst;
			swap_instance(inst, packed);
			dest.push_back(inst);
		}
	}
	
	static void write(OutBuffer dest, const std::vector<Instance>& src, Game game) {
		TableHeader header = {(s32) src.size()};
		dest.write(header);
		for(Instance camera : src) {
			Packed packed;
			swap_instance(camera, packed);
			dest.write(packed);
		}
	}
};

packed_struct(ImportCameraPacked,
	s32 unknown_0;
	s32 unknown_4;
	s32 unknown_8;
	s32 unknown_c;
	s32 unknown_10;
	s32 unknown_14;
	s32 unknown_18;
	s32 pvar_index;
)

static void swap_instance(ImportCamera& l, ImportCameraPacked& r) {
	SWAP_PACKED(l.unknown_0, r.unknown_0);
	SWAP_PACKED(l.unknown_4, r.unknown_4);
	SWAP_PACKED(l.unknown_8, r.unknown_8);
	SWAP_PACKED(l.unknown_c, r.unknown_c);
	SWAP_PACKED(l.unknown_10, r.unknown_10);
	SWAP_PACKED(l.unknown_14, r.unknown_14);
	SWAP_PACKED(l.unknown_18, r.unknown_18);
	SWAP_PACKED(l.pvar_index, r.pvar_index);
}

packed_struct(SoundInstancePacked,
	s16 o_class;
	s16 m_class;
	u32 update_fun_ptr;
	s32 pvar_index;
	f32 range;
	GpShape cuboid;
)

static void swap_instance(SoundInstance& l, SoundInstancePacked& r) {
	SWAP_PACKED(l.o_class, r.o_class);
	SWAP_PACKED(l.m_class, r.m_class);
	r.update_fun_ptr = 0;
	SWAP_PACKED(l.pvar_index, r.pvar_index);
	SWAP_PACKED(l.range, r.range);
	SWAP_PACKED(l.cuboid, r.cuboid);
}

struct ClassBlock {
	static void read(std::vector<s32>& dest, Buffer src, Game game) {
		s32 count = src.read<s32>(0, "class count");
		dest = src.read_multiple<s32>(4, count, "class data").copy();
	}
	
	static void write(OutBuffer dest, const std::vector<s32>& src, Game game) {
		dest.write((s32) src.size());
		dest.write_multiple(src);
	}
};

packed_struct(MobyBlockHeader,
	s32 static_count;
	s32 dynamic_count;
	s32 pad[2];
)

packed_struct(MobyInstanceRAC23,
	s32 size;        // 0x0 Always 0x88.
	s32 mission;     // 0x4
	s32 unknown_8;   // 0x8
	s32 unknown_c;   // 0xc
	s32 uid;         // 0x10
	s32 bolts;       // 0x14
	s32 unknown_18;  // 0x18
	s32 unknown_1c;  // 0x1c
	s32 unknown_20;  // 0x20
	s32 unknown_24;  // 0x24
	s32 o_class;     // 0x28
	f32 scale;       // 0x2c
	s32 draw_dist;   // 0x30
	s32 update_dist; // 0x34
	s32 unknown_38;  // 0x38
	s32 unknown_3c;  // 0x3c
	Vec3f position;  // 0x40
	Vec3f rotation;  // 0x4c
	s32 group;       // 0x58
	s32 is_rooted;   // 0x5c
	f32 rooted_dist; // 0x60
	s32 unknown_4c;  // 0x64
	s32 pvar_index;  // 0x68
	s32 occlusion;   // 0x6c
	s32 mode_bits;   // 0x70
	Rgb96 light_col; // 0x74
	s32 light;       // 0x80
	s32 unknown_84;  // 0x84
)

struct RAC23MobyBlock {
	static void read(Gameplay& dest, Buffer src, Game game) {
		dest.moby_instances = std::vector<MobyInstance>();
		auto& header = src.read<MobyBlockHeader>(0, "moby block header");
		for(MobyInstanceRAC23 entry : src.read_multiple<MobyInstanceRAC23>(0x10, header.static_count, "moby instances")) {
			verify(entry.size == 0x88, "Moby size field has invalid value.");
			
			MobyInstance instance;
			swap_moby(instance, entry);
			dest.moby_instances->push_back(instance);
		}
		dest.dynamic_moby_count = header.dynamic_count;
	}
	
	static bool write(OutBuffer dest, const Gameplay& src, Game game) {
		assert(src.moby_instances.has_value());
		assert(src.dynamic_moby_count.has_value());
		MobyBlockHeader header = {0};
		header.static_count = src.moby_instances->size();
		header.dynamic_count = *src.dynamic_moby_count;
		dest.write(header);
		for(MobyInstance instance : *src.moby_instances) {
			MobyInstanceRAC23 entry;
			swap_moby(instance, entry);
			dest.write(entry);
		}
		return true;
	}
	
	static void swap_moby(MobyInstance& l, MobyInstanceRAC23& r) {
		SWAP_PACKED(l.size, r.size);
		SWAP_PACKED(l.mission, r.mission);
		SWAP_PACKED(l.rac23.unknown_8, r.unknown_8);
		SWAP_PACKED(l.rac23.unknown_c, r.unknown_c);
		SWAP_PACKED(l.uid, r.uid);
		SWAP_PACKED(l.bolts, r.bolts);
		SWAP_PACKED(l.rac23.unknown_18, r.unknown_18);
		SWAP_PACKED(l.rac23.unknown_1c, r.unknown_1c);
		SWAP_PACKED(l.rac23.unknown_20, r.unknown_20);
		SWAP_PACKED(l.rac23.unknown_24, r.unknown_24);
		SWAP_PACKED(l.o_class, r.o_class);
		SWAP_PACKED(l.scale, r.scale);
		SWAP_PACKED(l.draw_dist, r.draw_dist);
		SWAP_PACKED(l.update_dist, r.update_dist);
		SWAP_PACKED(l.rac23.unknown_38, r.unknown_38);
		SWAP_PACKED(l.rac23.unknown_3c, r.unknown_3c);
		SWAP_PACKED(l.position, r.position);
		SWAP_PACKED(l.rotation, r.rotation);
		SWAP_PACKED(l.group, r.group);
		SWAP_PACKED(l.is_rooted, r.is_rooted);
		SWAP_PACKED(l.rooted_dist, r.rooted_dist);
		SWAP_PACKED(l.rac23.unknown_4c, r.unknown_4c);
		SWAP_PACKED(l.pvar_index, r.pvar_index);
		SWAP_PACKED(l.occlusion, r.occlusion);
		SWAP_PACKED(l.mode_bits, r.mode_bits);
		SWAP_PACKED(l.light_col, r.light_col);
		SWAP_PACKED(l.light, r.light);
		SWAP_PACKED(l.rac23.unknown_84, r.unknown_84);
	}
};

packed_struct(MobyInstanceDL,
	s32 size;        // 0x0 Always 0x70.
	s32 mission;     // 0x4
	s32 uid;         // 0x8
	s32 bolts;       // 0xc
	s32 o_class;     // 0x10
	f32 scale;       // 0x14
	s32 draw_dist;   // 0x18
	s32 update_dist; // 0x1c
	s32 unknown_20;  // 0x20
	s32 unknown_24;  // 0x24
	Vec3f position;  // 0x28
	Vec3f rotation;  // 0x34
	s32 group;       // 0x40
	s32 is_rooted;   // 0x44
	f32 rooted_dist; // 0x48
	s32 unknown_4c;  // 0x4c
	s32 pvar_index;  // 0x50
	s32 occlusion;   // 0x54
	s32 mode_bits;   // 0x58
	Rgb96 light_col; // 0x5c
	s32 light;       // 0x68
	s32 unknown_6c;  // 0x6c
)
static_assert(sizeof(MobyInstanceDL) == 0x70);

struct DeadlockedMobyBlock {
	static void read(Gameplay& dest, Buffer src, Game game) {
		dest.moby_instances = std::vector<MobyInstance>();
		auto& header = src.read<MobyBlockHeader>(0, "moby block header");
		for(MobyInstanceDL entry : src.read_multiple<MobyInstanceDL>(0x10, header.static_count, "moby instances")) {
			verify(entry.size == 0x70, "Moby size field has invalid value.");
			verify(entry.unknown_20 == 32, "Moby field has weird value.");
			verify(entry.unknown_24 == 64, "Moby field has weird value.");
			verify(entry.unknown_4c == 1, "Moby field has weird value.");
			verify(entry.unknown_6c == -1, "Moby field has weird value.");
			
			MobyInstance instance;
			swap_moby(instance, entry);
			dest.moby_instances->push_back(instance);
		}
		dest.dynamic_moby_count = header.dynamic_count;
	}
	
	static bool write(OutBuffer dest, const Gameplay& src, Game game) {
