#pragma wrench parser on

struct update9867 { // 0x770
	/* 0x000 */ SubVars sVars;
	/* 0x050 */ TargetVars tVars;
	/* 0x0e0 */ MoveVars_V2 mVars;
	/* 0x290 */ ReactVars rVars;
	/* 0x310 */ BogeyVars bVars;
	/* 0x3a0 */ EffectorVars eVars;
	/* 0x3b0 */ CommandVars cVars;
	/* 0x3d0 */ NavigationVars navVars;
	/* 0x420 */ FlashVars fVars;
	/* 0x430 */ Tweaker headTweak;
	/* 0x4b0 */ Tweaker leftArmTweak;
	/* 0x530 */ Tweaker rightArmTweak;
	/* 0x5b0 */ Tweaker spineTweak;
	/* 0x630 */ Manipulator tailManip;
	/* 0x670 */ char doNotInterrupt;
	/* 0x671 */ char hold;
	/* 0x672 */ char botIndex;
	/* 0x673 */ char iconType;
	/* 0x674 */ char currentWeapon;
	/* 0x675 */ char needFormation;
	/* 0x676 */ char noFire;
	/* 0x677 */ char shotsToFire;
	/* 0x678 */ char moveState;
	/* 0x679 */ char voice;
	/* 0x67a */ char completed;
	/* 0x67b */ char startCaptured;
	/* 0x67c */ char nextWeapon;
	/* 0x67d */ char beamFade;
	/* 0x67e */ char atkCnt;
	/* 0x67f */ char numAttacking;
	/* 0x680 */ char coverCnt;
	/* 0x681 */ char dmgCnt;
	/* 0x682 */ char initVO;
	/* 0x683 */ char curHead;
	/* 0x684 */ char curPaintjob;
	/* 0x685 */ char moveTrigger;
	/* 0x686 */ char prevMoveState;
	/* 0x687 */ char lastNumAttacking;
	/* 0x688 */ char silent;
	/* 0x689 */ char damagedMode;
	/* 0x68a */ char padA[6];
	/* 0x690 */ char lastAffirmVO;
	/* 0x691 */ char lastKillVO;
	/* 0x692 */ char lastEmpVO;
	/* 0x693 */ char lastVictoryVO;
	/* 0x694 */ char lastReviveVO;
	/* 0x695 */ char lastAttackedVO;
	/* 0x696 */ char lastCompleteVO;
	/* 0x697 */ char lastDamageVO;
	/* 0x698 */ char lastDeathVO;
	/* 0x699 */ char lastAttackingVO;
	/* 0x69a */ char padB[6];
	/* 0x6a0 */ short int alertTimer;
	/* 0x6a2 */ short int shootTimer;
	/* 0x6a4 */ short int iconTimer;
	/* 0x6a6 */ short int recallTimer;
	/* 0x6a8 */ short int updateTimer;
	/* 0x6aa */ short int grenadeTimer;
	/* 0x6ac */ short int drawFireTimer;
	/* 0x6ae */ short int cmdTimer;
	/* 0x6b0 */ short int cmdTotalTime;
	/* 0x6b4 */ float cmdDistThreshold;
	/* 0x6b8 */ int cmdColor;
	/* 0x6bc */ IssuedCommand *pCommand;
	/* 0x6c0 */ moby *pVehicle;
	/* 0x6c4 */ moby *pCover;
	/* 0x6c8 */ moby *pGun;
	/* 0x6cc */ moby *pGrenade;
	/* 0x6d0 */ moby *pFunkyHead;
	/* 0x6d4 */ int curVO;
	/* 0x6d8 */ int moveTimer;
	/* 0x6dc */ int teleportTimer;
	/* 0x6e0 */ vec4 moveTarget;
	/* 0x6f0 */ vec4 moveDest;
	/* 0x700 */ vec4 source;
	/* 0x710 */ vec4 formation;
	/* 0x720 */ vec4 avoidPos;
	/* 0x730 */ int boltCrankSoundHandle;
	/* 0x734 */ int reviveSoundHandle;
	/* 0x738 */ int jetSoundHandle;
	/* 0x73c */ int healSoundHandle;
	/* 0x740 */ int alternateStart;
	/* 0x744 */ int alternateExit;
	/* 0x748 */ int activateCuboid;
	/* 0x74c */ float tailAngle;
	/* 0x750 */ float wrenchFitT;
	/* 0x754 */ float moveHeight;
	/* 0x758 */ float moveHeightTarget;
	/* 0x75c */ float moveSpeed;
	/* 0x760 */ float bobHeight;
	/* 0x764 */ float reviveAnimFrame;
	/* 0x768 */ int reviveEffectLight;
	/* 0x76c */ char reviveEffectTimer;
	/* 0x76d */ char isShielded;
	/* 0x76e */ short int attackTimer;
};
