#pragma wrench parser on

struct update8248 { // 0x590
	/* 0x000 */ SubVars sVars;
	/* 0x050 */ TargetVars tVars;
	/* 0x0e0 */ FlashVars fVars;
	/* 0x0f0 */ EffectorVars eVars;
	/* 0x100 */ ReactVars rVars;
	/* 0x180 */ FpsCamVars driverFpsVars;
	/* 0x2e0 */ VehicleBase *pVehicleBase;
	/* 0x2e4 */ float fCameraYaw;
	/* 0x2e8 */ float fLastCameraBodyZ;
	/* 0x2ec */ float fLastReticuleFrac;
	/* 0x2f0 */ char bHasLegs;
	/* 0x2f1 */ unsigned char cChargedMortarBarrels;
	/* 0x2f2 */ char cTimer;
	/* 0x2f3 */ char cDriverCameraActive;
	/* 0x2f4 */ moby *pLegs;
	/* 0x2f8 */ float fFacingYaw;
	/* 0x2fc */ float fAimPitch;
	/* 0x300 */ float fYawSpeed;
	/* 0x304 */ float fPitchSpeed;
	/* 0x308 */ float fGunRotSpeed;
	/* 0x30c */ int iGunFireTimer;
	/* 0x310 */ int iMortarChargeTimer;
	/* 0x314 */ int iMortarFireTimer;
	/* 0x318 */ float fMortarPitch;
	/* 0x31c */ float fMortarRotSpeed;
	/* 0x320 */ moby *pController;
	/* 0x324 */ float fMortarAimYaw;
	/* 0x328 */ float fMortarAimPitch;
	/* 0x32c */ float fMortarAimYawSpeed;
	/* 0x330 */ float fMortarAimPitchSpeed;
	/* 0x334 */ float fLastPassengerCameraBodyZ;
	/* 0x338 */ float fLastPassengerReticuleFrac;
	/* 0x33c */ char cPassengerCameraActive;
	/* 0x33d */ char cMortarBarrelToFire;
	/* 0x33e */ char bLegsControlled;
	/* 0x33f */ char killHornSound;
	/* 0x340 */ int iMortarProjectileGroup;
	/* 0x344 */ float fFrontCanopyPitch;
	/* 0x348 */ float fBackCanopyPitch;
	/* 0x34c */ char bPreexplodeSoundPlayed;
	/* 0x34d */ char bExplodeSoundPlayed;
	/* 0x34e */ unsigned char cHitEffectAnyActive;
	/* 0x34f */ unsigned char cHitEffectLastUsed;
	/* 0x350 */ short int iSoundTurning;
	/* 0x352 */ short int iSoundMortarCharge;
	/* 0x354 */ char bAutoGrabPlayer;
	/* 0x355 */ char bCannotExitVehicle;
	/* 0x356 */ short int iSoundHorn;
	/* 0x358 */ moby *pStationaryTurretBase;
	/* 0x35c */ unsigned char cHitEffectTimers[2];
	/* 0x35e */ char cPadB[1];
	/* 0x35f */ char bAutoSpawn;
	/* 0x360 */ float fHitEffectPitches[2];
	/* 0x368 */ float fHitEffectYaws[2];
	/* 0x370 */ char mortarRefireDelay[6];
	/* 0x376 */ char cMortarBarrelCharging;
	/* 0x377 */ char cNextMortarTarget;
	/* 0x378 */ moby *pMortarTargets[6];
	/* 0x390 */ vec4 vLastCameraPos;
	/* 0x3a0 */ vec4f vLastCameraRot;
	/* 0x3b0 */ vec4 vLastPassengerCameraPos;
	/* 0x3c0 */ vec4f vLastPassengerCameraRot;
	/* 0x3d0 */ Manipulator gunPitchManips[2];
	/* 0x450 */ Manipulator gunRotManips[2];
	/* 0x4d0 */ Manipulator mortarManip;
	/* 0x510 */ Manipulator frontCanopyManip;
	/* 0x550 */ Manipulator backCanopyManip;
};
