#pragma wrench parser on

struct SubVars {
	/* 0x00 */ void* unknown_00;
	/* 0x04 */ void* unknown_04;
	/* 0x08 */ void* unknown_08;
	/* 0x0c */ void* unknown_0c;
	/* 0x10 */ void* unknown_10;
	/* 0x14 */ void* unknown_14;
	/* 0x18 */ void* unknown_18;
	/* 0x1c */ void* unknown_1c;
};

struct RacVars00 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
};

struct RacVars04 {
	/* 0x00 */ int unknown_0;
};

struct RacVars08 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
};

struct RacVars0c {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
};

struct RacVars10 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
	/* 0x40 */ int unknown_40;
	/* 0x44 */ int unknown_44;
	/* 0x48 */ int unknown_48;
	/* 0x4c */ int unknown_4c;
	/* 0x50 */ int unknown_50;
	/* 0x54 */ int unknown_54;
	/* 0x58 */ int unknown_58;
	/* 0x5c */ int unknown_5c;
};

struct RacVars14 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
	/* 0x40 */ int unknown_40;
	/* 0x44 */ int unknown_44;
	/* 0x48 */ int unknown_48;
	/* 0x4c */ int unknown_4c;
	/* 0x50 */ int unknown_50;
	/* 0x54 */ int unknown_54;
	/* 0x58 */ int unknown_58;
	/* 0x5c */ int unknown_5c;
	/* 0x60 */ int unknown_60;
	/* 0x64 */ int unknown_64;
	/* 0x68 */ int unknown_68;
	/* 0x6c */ int unknown_6c;
	/* 0x70 */ int unknown_70;
	/* 0x74 */ int unknown_74;
	/* 0x78 */ int unknown_78;
	/* 0x7c */ int unknown_7c;
	/* 0x80 */ int unknown_80;
	/* 0x84 */ int unknown_84;
	/* 0x88 */ int unknown_88;
	/* 0x8c */ int unknown_8c;
	/* 0x90 */ int unknown_90;
	/* 0x94 */ int unknown_94;
	/* 0x98 */ int unknown_98;
	/* 0x9c */ int unknown_9c;
	/* 0xa0 */ int unknown_a0;
	/* 0xa4 */ int unknown_a4;
	/* 0xa8 */ int unknown_a8;
	/* 0xac */ int unknown_ac;
};

struct RacVars18 {
	/* 0x00 */ int unknown_0;
	/* 0x04 */ int unknown_4;
	/* 0x08 */ int unknown_8;
	/* 0x0c */ int unknown_c;
	/* 0x10 */ int unknown_10;
	/* 0x14 */ int unknown_14;
	/* 0x18 */ int unknown_18;
	/* 0x1c */ int unknown_1c;
	/* 0x20 */ int unknown_20;
	/* 0x24 */ int unknown_24;
	/* 0x28 */ int unknown_28;
	/* 0x2c */ int unknown_2c;
	/* 0x30 */ int unknown_30;
	/* 0x34 */ int unknown_34;
	/* 0x38 */ int unknown_38;
	/* 0x3c */ int unknown_3c;
	/* 0x40 */ int unknown_40;
	/* 0x44 */ int unknown_44;
	/* 0x48 */ int unknown_48;
	/* 0x4c */ int unknown_4c;
};

struct RacVars1c {
	/* 0x00 */ int unknown_0;
};
