#pragma wrench parser on

struct update4018 { // 0x40
	/* 0x00 */ float highHeight;
	/* 0x04 */ float lowHeight;
	/* 0x08 */ float ang;
	/* 0x0c */ float rate;
	/* 0x10 */ int waterTile;
	/* 0x14 */ char frozen;
	/* 0x15 */ char reqBalls;
	/* 0x16 */ short int freezeTimer;
	/* 0x18 */ int groupMaster;
	/* 0x1c */ int collDataIndex;
	/* 0x20 */ int swimArea;
	/* 0x24 */ int effectPath;
	/* 0x28 */ int drawCube;
	/* 0x2c */ float stickHeight;
	/* 0x30 */ float moveSpeed;
	/* 0x34 */ float reticuleDist;
	/* 0x38 */ int soundChannel;
	/* 0x3c */ int pad[1];
};
